# Getting Started With SQL and BigQuery
[Kaggles's Getting Started With SQL and BigQuery](https://www.kaggle.com/dansbecker/getting-started-with-sql-and-bigquery)

[Exercise: Getting Started With SQL and BigQuery](https://www.kaggle.com/aubreyjohn/exercise-getting-started-with-sql-and-bigquery/edit)

**Note:**

Each Kaggle user can scan 5TB every 30 days for free. Once you hit that limit, you'll have to wait for it to reset.

# Select, From & Where
[Kaggles's Select, From & Where](https://www.kaggle.com/dansbecker/select-from-where)

[Exercise: Select, From & Where](https://www.kaggle.com/aubreyjohn/exercise-select-from-where/edit)

# Groupby, having and count
[Kaggles's Groupby, having and count](https://www.kaggle.com/learn/intro-to-sql)

[Exercise: Groupby, having and count](https://www.kaggle.com/aubreyjohn/exercise-group-by-having-count/edit)

# OrderBy
[Kaggles's OrderBy](https://www.kaggle.com/dansbecker/order-by)

[Exercise: OrderBy](https://www.kaggle.com/aubreyjohn/exercise-order-by/edit)

# AS & WITH
[Kaggles's AS & WITH](https://www.kaggle.com/dansbecker/as-with)

[Exercise: AS & WITH](https://www.kaggle.com/aubreyjohn/exercise-as-with/edit)

# Joining Data, LIKE
[Kaggles's Joining Data](https://www.kaggle.com/dansbecker/joining-data)

[Exercise: Joining Data](https://www.kaggle.com/aubreyjohn/exercise-joining-data/edit)

# Joins and Unions
[Kaggles's Joins and Unions](https://www.kaggle.com/alexisbcook/joins-and-unions)

[Exercise: Joins and Unions](https://www.kaggle.com/aubreyjohn/exercise-joins-and-unions/edit)

# Analytic Functions
[Kaggles's Analytic Functions](https://www.kaggle.com/alexisbcook/analytic-functions)

[Exercise: Analytic Functions](https://www.kaggle.com/aubreyjohn/exercise-analytic-functions/edit)

# Nested and Repeated Data
[Kaggles's Nested and Repeated Data](https://www.kaggle.com/alexisbcook/nested-and-repeated-data)

[Exercise: Nested and Repeated Data](https://www.kaggle.com/aubreyjohn/exercise-nested-and-repeated-data/edit)

# Writing Efficient Queries
[Kaggles's Writing Efficient Queries](https://www.kaggle.com/alexisbcook/writing-efficient-queries)

[Exercise: Writing Efficient Queries](https://www.kaggle.com/aubreyjohn/exercise-writing-efficient-queries/edit)

# Connect to MySql Database

In [1]:
import mysql.connector # import the mysql connector
import pandas as pd

In [2]:
mysql_conn = mysql.connector.connect(
    host="localhost", 
    user="root", 
    passwd="",
    database="employees"
)

if mysql_conn:    
    print('Success! Database connected successfully') 
else: 
    print("Error! Database not connected")

Success! Database connected successfully

# Show tables in a MySql Database

In [3]:
# show all the tables in our database 
mycursor = mysql_conn.cursor() 
query_tables = "SHOW TABLES" 
mycursor.execute(query_tables) 
all_tables = mycursor.fetchall() 
all_tables

[('current_dept_emp',),
 ('departments',),
 ('dept_emp',),
 ('dept_emp_latest_date',),
 ('dept_manager',),
 ('employees',),
 ('salaries',),
 ('titles',)]

## View current_dept_emp table

In [4]:
current_dept_emp_df = pd.read_sql_query("SELECT * FROM current_dept_emp", mysql_conn)
current_dept_emp_df.head()

   emp_no dept_no   from_date     to_date
0   10001    d005  1986-06-26  9999-01-01
1   10002    d007  1996-08-03  9999-01-01
2   10003    d004  1995-12-03  9999-01-01
3   10004    d004  1986-12-01  9999-01-01
4   10005    d003  1989-09-12  9999-01-01

## View departments table

In [5]:
departments_df = pd.read_sql_query("SELECT * FROM departments", mysql_conn)
departments_df.head()

  dept_no         dept_name
0    d009  Customer Service
1    d005       Development
2    d002           Finance
3    d003   Human Resources
4    d001         Marketing

## View dept_emp table

In [6]:
dept_emp_df = pd.read_sql_query("SELECT * FROM dept_emp", mysql_conn)
dept_emp_df.head()

   emp_no dept_no   from_date     to_date
0   10001    d005  1986-06-26  9999-01-01
1   10002    d007  1996-08-03  9999-01-01
2   10003    d004  1995-12-03  9999-01-01
3   10004    d004  1986-12-01  9999-01-01
4   10005    d003  1989-09-12  9999-01-01

## View dept_emp_latest_date table

In [7]:
dept_emp_latest_date_df = pd.read_sql_query("SELECT * FROM dept_emp_latest_date", mysql_conn)
dept_emp_latest_date_df.head()

   emp_no   from_date     to_date
0   10001  1986-06-26  9999-01-01
1   10002  1996-08-03  9999-01-01
2   10003  1995-12-03  9999-01-01
3   10004  1986-12-01  9999-01-01
4   10005  1989-09-12  9999-01-01

## View dept_manager table

In [8]:
dept_manager_df = pd.read_sql_query("SELECT * FROM dept_manager", mysql_conn)
dept_manager_df.head()

   emp_no dept_no   from_date     to_date
0  110022    d001  1985-01-01  1991-10-01
1  110039    d001  1991-10-01  9999-01-01
2  110085    d002  1985-01-01  1989-12-17
3  110114    d002  1989-12-17  9999-01-01
4  110183    d003  1985-01-01  1992-03-21

## View employees table

In [9]:
employees_df = pd.read_sql_query("SELECT * FROM employees", mysql_conn)
employees_df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

## View salaries table

In [10]:
salaries_df = pd.read_sql_query("SELECT * FROM salaries", mysql_conn)
salaries_df.head()

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10001   62102  1987-06-26  1988-06-25
2   10001   66074  1988-06-25  1989-06-25
3   10001   66596  1989-06-25  1990-06-25
4   10001   66961  1990-06-25  1991-06-25

## View titles table

In [11]:
titles_df = pd.read_sql_query("SELECT * FROM titles", mysql_conn)
titles_df.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

# Connect to Oracle Database

## Connect to scott in container xepdb1

In [12]:
# Import database specific module
import cx_Oracle

# Create a connection to an Oracle database 
try: 
    # Establish a connection using connect() function
    oracle_conn = cx_Oracle.connect('scott/tiger@xepdb1') 
    print('Successful connection!')
except cx_Oracle.DatabaseError as e: 
    print("There is a problem with Oracle", e)

Successful connection!

## using cursors

In [13]:
cursor = oracle_conn.cursor() 
cursor.execute("select table_name from user_tables") 
all_tables = cursor.fetchall() 
all_tables

[('DEPT',), ('EMP',), ('BONUS',), ('SALGRADE',)]

## using pandas

In [14]:
scott_tables_df = pd.read_sql_query('select table_name from user_tables', oracle_conn)
scott_tables_df

  TABLE_NAME
0       DEPT
1        EMP
2      BONUS
3   SALGRADE

In [15]:
scott_dept_df = pd.read_sql_query('select * from dept fetch next 5 rows only', oracle_conn)
scott_dept_df

   DEPTNO       DNAME       LOC
0      10  ACCOUNTING  NEW YORK
1      20    RESEARCH    DALLAS
2      30       SALES   CHICAGO
3      40  OPERATIONS    BOSTON

## Connect to hr_new in container xepdb1

In [16]:
# Create a connection to an Oracle database 
try: 
    # Establish a connection using connect() function
    oracle_conn = cx_Oracle.connect('hr_new/hr_new@xepdb1') 
    print('Successful connection!')
except cx_Oracle.DatabaseError as e: 
    print("There is a problem with Oracle", e)

Successful connection!

In [17]:
# view tables in hr_new
hr_new_tables_df = pd.read_sql_query('select table_name from user_tables', oracle_conn)
hr_new_tables_df

  TABLE_NAME
0     HR_NEW

In [18]:
# view hr_new
hr_new_df = pd.read_sql_query('select * from HR_NEW', oracle_conn)
hr_new_df.head()

,EMPLOYEE_ID,DEPARTMENT,REGION,EDUCATION,GENDER,RECRUITMENT_CHANNEL,NO_OF_TRAININGS,AGE,PREVIOUS_YEAR_RATING,LENGTH_OF_SERVICE,KPIS_MET,AWARDS_WON,AVG_TRAINING_SCORE
0,8724,Technology,region_26,Bachelor's,m,sourcing,1,24,NaN,1,1,0,77
1,74430,HR,region_4,Bachelor's,f,other,1,31,3.0,5,0,0,51
2,72255,Sales & Marketing,region_13,Bachelor's,m,other,1,31,1.0,4,0,0,47
3,38562,Procurement,region_2,Bachelor's,f,other,3,31,2.0,9,0,0,65
4,64486,Finance,region_29,Bachelor's,m,sourcing,1,30,4.0,7,0,0,61

## Load Exits for the period 24thDec 2019-14th Jan 2020.csv

In [20]:
exits_df = pd.read_csv('Exits for the period 24thDec 2019-14th Jan 2020.csv')
exits_df.head()

,EMPLOYEE_NUMBER,NAME,USERNAME,BRANCH,GRADE,EXIT DATE
0,KEN4397,Francis Ndambuki Mulwa,FMULWA,Masii Branch,MLA,20-Dec-19
1,KEN6400,Judson Oroti Nyakundi,JNYAKUNDI,Kakamega Branch,MLB,24-Dec-19
2,KEN6480,Mwevetsi Chrysantus Ajevi,CAJEVI,Consumer Credit Department,MLC,25-Dec-19
3,KEN7704,Elijah Kibagendi Nyarangi,ENYARANGI,Biashara Street Branch,MLC,26-Dec-19
4,KEN19044,Pauline Kajuju Kirema,pkirema,Westgate Mall Branch,DSR,02-Dec-19